package h01数组和矩阵;

import org.junit.Test;

/**
 * 给你一个整数数组 nums ，请你找出数组中乘积最大的连续子数组（该子数组中至少包含一个数字），并返回该子数组所对应的乘积。
 *
 *  示例 1:
 *  输入: [2,3,-2,4]
 * 输出: 6
 * 解释: 子数组 [2,3] 有最大乘积 6。
 *
 *  示例 2:
 *  输入: [-2,0,-1]
 * 输出: 0
 * 解释: 结果不能为 2, 因为 [-2,-1] 不是子数组。
 *  Related Topics 数组 动态规划
 *  👍 1211 👎 0 难度：中
 *  https://leetcode-cn.com/problems/maximum-product-subarray/
 *
 * Create by @author sharpyangwei on 2021/8/2 - 下午4:48
 */
public class lc152乘积最大子数组 {

    public int maxProduct(int[] nums) {
        return 0;
    }
}
